# Домашнее задание №2. Pandas

### Задание 1

1. Создайте серию `pd.Series`, которая будет содрежать инфомацию о целочисленных оценках на экзамене по алгебре учеников: Александр, Борис, Владимир, Дмитрий, Григорий, Евгений, Игорь, Клим, Леонид, Максим. Созданную серию сохраните в переменную one_mark. Этой серии задайте имя "Оценка по алгебре". Выведите полученную серию на экран.
2. Увеличьте оценку Максима на 1 балл и сохраните ее в серии. Выведите на экран из серию только оценку Максима.
3. Задав маску, получить и вывести информацию о тем учениках, у которых оценка не меньше 4.

In [1]:
%matplotlib inline
import pandas as pd
import numpy as np
from random import randint

In [2]:
people = "Александр,Борис,Владимир,Дмитрий,Григорий,Евгений,Игорь,Клим,Леонид,Максим".split(",")
marks = [randint(2, 5) for _ in range(len(people))]

one_mark = pd.Series(marks, index=people, name="Оценка по алгебре")
print("Ответ на 1 пункт:\n", one_mark)

print("==================================================")

print("Оценка Максима до: ", one_mark["Максим"])
if one_mark["Максим"] < 5:
    one_mark["Максим"] += 1
print("Оценка Максима после: ", one_mark["Максим"])

print("==================================================")

print(one_mark[one_mark >= 4])

Ответ на 1 пункт:
 Александр    2
Борис        5
Владимир     2
Дмитрий      4
Григорий     3
Евгений      5
Игорь        3
Клим         5
Леонид       3
Максим       5
Name: Оценка по алгебре, dtype: int64
==================================================
Оценка Максима до:  5
Оценка Максима после:  5
==================================================
Борис      5
Дмитрий    4
Евгений    5
Клим       5
Максим     5
Name: Оценка по алгебре, dtype: int64

### Задание 2

Создайте `pd.DataFrame`, которая будет содержать инфомацию о целочисленных оценках на экзаменах по алгебре, геометрии и физике учеников: Александр, Борис, Владимир, Дмитрий, Григорий, Евгений, Игорь, Клим, Леонид, Максим. Оценки сгенерируйте случайным образом. Созданный `DataFrame` сохраните в переменную marks. Этому `DataFrame` задайте имя "*Экзаменационные оценки*" и выведите его на экран.

In [3]:
people = "Александр,Борис,Владимир,Дмитрий,Григорий,Евгений,Игорь,Клим,Леонид,Максим".split(",")   # Строчки 

algebra_marks = np.array([randint(2, 5) for _ in range(len(people))])
geometry_marks =  np.array([randint(2, 5) for _ in range(len(people))])
physics_marks =  np.array([randint(2, 5) for _ in range(len(people))])

marks = pd.DataFrame({
    'Алгебра': algebra_marks,
    'Геометрия': geometry_marks,
    'Физика': physics_marks
}, index=people)

print("Экзаменационные оценки:\n", marks)

Экзаменационные оценки:
            Алгебра  Геометрия  Физика
Александр        4          4       4
Борис            5          2       3
Владимир         4          4       2
Дмитрий          2          3       2
Григорий         3          3       3
Евгений          5          4       5
Игорь            4          5       4
Клим             3          5       3
Леонид           4          2       3
Максим           3          2       2

### Задание 3

Полученный в предыдущем задании `marks` изменить следующим образом (все изменения должны быть сохранены в `marks`):
  1.  Оценки всех учеников по геометрии уменьшите на 1 балл.
  2.  Увеличьте все оценки Максима на 1 балл.
  3.  Измените оценку по алгебре у Бориса на 5.
  4.  Измените все оценки в столбце №2 на 4. <br>
Выведите `marks` на экран.

In [4]:
# Проверка, чтобы оценка не была ниже 2 и больше 5
def clip_marks(marks):
    return marks.clip(lower=2, upper=5)

marks2 = marks
marks2["Геометрия"] = clip_marks(marks2["Геометрия"] - 1)   # Уменьшить на 1 балл всем по Геометрии
marks2.loc["Максим"] = clip_marks(marks.loc['Максим'] + 1)  # Увеличить на 1 балл все оценки Максиму
marks2.loc['Борис', 'Алгебра'] = 5                          # Изменить оценку по алгебре у Бориса на 5
marks.iloc[:, 1] = 4                                        # Изменить все оценки в столбце №2 (Геометрия) на 4

print(marks2)

           Алгебра  Геометрия  Физика
Александр        4          4       4
Борис            5          4       3
Владимир         4          4       2
Дмитрий          2          4       2
Григорий         3          4       3
Евгений          5          4       5
Игорь            4          4       4
Клим             3          4       3
Леонид           4          4       3
Максим           4          4       3

### Задание 4

Загрузите с Kaggle любым способом данные по ссылке: https://www.kaggle.com/datasets/spscientist/students-performance-in-exams, а затем выполните следующие задания:
  1.  Добавить в `df` столбец *Средний балл*, в который разместите поделенную на 3 сумму оценок из трёх стобцов: *math score*, *reading score*, *writing score*. Вывести на экран результат.
  2. Произвести группировку по полу ученика (значение в столбце *gender*). После для каждой из полученных групп, найти наименьшее, среднее, наибольшее значение в поле *Средний балл*. Вывести на экран результат.

In [5]:
df = pd.read_csv('StudentsPerformance.csv')
df['Средний балл'] = (df['math score'] + df['reading score'] + df['writing score']) / 3
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Средний балл
0,female,group B,bachelor's degree,standard,none,72,72,74,72.666667
1,female,group C,some college,standard,completed,69,90,88,82.333333
2,female,group B,master's degree,standard,none,90,95,93,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.333333
4,male,group C,some college,standard,none,76,78,75,76.333333
...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95,94.000000
996,male,group C,high school,free/reduced,none,62,55,55,57.333333
997,female,group C,high school,free/reduced,completed,59,71,65,65.000000
998,female,group D,some college,standard,completed,68,78,77,74.333333
999,female,group D,some college,free/reduced,none,77,86,86,83.000000

In [6]:
grouped = df.groupby('gender')['Средний балл'].agg(['min', 'mean', 'max'])
print(grouped)

         min       mean    max
gender
female   9.0  69.569498  100.0
male    23.0  65.837483  100.0

### Задание 5

In [7]:
# Рассмотрим набор оценок на экзаменах по математике и физике студентов двух групп:
import random
df_marks = pd.DataFrame({'group': ["group_A" if random.random()>0.5 else "group_B" for i in range(12)],
                         'math score': [random.randint(40,100) for _ in range(12)],
                         'physics score': [random.randint(40,100) for _ in range(12)]})
df_marks.head(3)

     group  math score  physics score
0  group_B          51             91
1  group_A          92             57
2  group_A          53             69

  1.  Из набора данных `df_marks` получить выборку студентов у которых по всем экзаменам набрано более 60 баллов. Результат сохранить в `df_marks2`.

  2. В `df_marks2` произвести группировку по группе ученика (по значению в столбце *group*). После, используя операцию агрегации, получить для каждой группы среднее значение оценки за каждый экзамен и его разделить на 100.

In [8]:
df_marks2 = df_marks.where((df_marks['math score']>=60)&(df_marks['physics score']>=60)).dropna()
df_marks2

      group  math score  physics score
3   group_A        80.0           96.0
4   group_B        62.0           98.0
5   group_B        73.0           66.0
10  group_B        88.0           67.0

In [9]:
aggregated_df = df_marks2.groupby('group').agg(
    math_score_mean=('math score', 'mean'),
    physics_score_mean=('physics score', 'mean')
).reset_index()
print(aggregated_df)

aggregated_df[['math_score_mean', 'physics_score_mean']] /= 100
print(aggregated_df)

     group  math_score_mean  physics_score_mean
0  group_A        80.000000                96.0
1  group_B        74.333333                77.0
     group  math_score_mean  physics_score_mean
0  group_A         0.800000                0.96
1  group_B         0.743333                0.77